snlkuharlocal/src/Documents/АктПриемкиМашины/АктПриемкиМашины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемкиМашины</name>
  <basedOn>Document.Машина</basedOn>
  <basedOn>Document.КоллективныеРаботы</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.КоллективныеРаботы</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительГрузополучателя</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительСтраховщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выявлено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеУпаковки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерCMR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеПримечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияИмеется</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНекондиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодвижнойСостав</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтрольныеУстройства</name>
    <comment>Пломбы</comment>
    <attributes>
      <name>ИдСтрокиПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПНК</name>
    <attributes>
      <name>ПриходнаяНакладная</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыТоваров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоКоробов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НарушенаЦелостностьУпаковки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтукНеТоварногоВида</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БлочковНеТоварногоВида</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоробовНеТоварногоВида</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Недостача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Излишки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасхождений</name>
      <type>
        <types>EnumRef.ТипыРасхождений</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПНК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Досмотр</name>
    <attributes>
      <name>МестоПроведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставленАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РеквизитыРНКПНКПРМ/РеквизитыРНКПНКПРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыРНКПНКПРМ</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/АктПриемкиМашины/ObjectModule.bsl
Функция ГруппыТоваров() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ПОМЕСТИТЬ СписокТоваров ИЗ Документ.ПриходнаяНакладная.Товары ГДЕ Ссылка В (&СписокПНК)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА Родитель.Родитель.Брэнд=&ПустаяСтрока ТОГДА Родитель.Родитель.Наименование ИНАЧЕ Родитель.Родитель.Брэнд КОНЕЦ КАК Брэнд
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка В (ВЫБРАТЬ Номенклатура ИЗ СписокТоваров)
	|	И НЕ ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО 
	|	ВЫБОР КОГДА Родитель.Родитель.Брэнд=&ПустаяСтрока ТОГДА Родитель.Родитель.Наименование ИНАЧЕ Родитель.Родитель.Брэнд КОНЕЦ";	
	
	Запрос.УстановитьПараметр("СписокПНК",СписокПНК.ВыгрузитьКолонку("ПриходнаяНакладная"));
	Запрос.УстановитьПараметр("ПустаяСтрока","");
	
	ГруппыТоваров="";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ТекБрэнд=?(ПустаяСтрока(Выборка.Брэнд),Выборка.Наименование,Выборка.Брэнд);
		ГруппыТоваров=ГруппыТоваров+Выборка.Брэнд+",";	
	КонецЦикла; 
	
	Если НЕ ПустаяСтрока(ГруппыТоваров) Тогда
		ГруппыТоваров=Лев(ГруппыТоваров,СтрДлина(ГруппыТоваров)-1)	
	КонецЕсли; 
	
	Возврат ГруппыТоваров;	
КонецФункции

///////////////////////// СОБЫТИЯ ОБЪЕКТА //////////////////////////////////////////////////////////

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);
		
		ГруппыТоваров=ГруппыТоваров();
		
		Если Отказ Тогда Возврат КонецЕсли;
	КонецЕсли;
		
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
	Валюта				=Неопределено;
	Курс				=Неопределено;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Основание) Тогда Возврат КонецЕсли;		
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Машина") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание,"ИБ,Организация,Склад,ГруппыТоваров,НомерМашины,ТранспортнаяКомпания");	
	    ДокОснование = Основание;
		СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом;

		ПодвижнойСостав.Загрузить(Основание.ПодвижнойСостав.Выгрузить());
		КонтрольныеУстройства.Загрузить(Основание.КонтрольныеУстройства.Выгрузить());
		
		ЗаполнитьСписокПНК(Основание);
		
		Если ПодвижнойСостав.Количество() = 0 Тогда
			
			НоваяСтрока = ПодвижнойСостав.Добавить();
			НоваяСтрока.Вид = "Автомобиль";
			НоваяСтрока.ИдСтроки = Строка(Новый УникальныйИдентификатор());
			НоваяСтрока.Номер = СокрЛП(НомерМашины);
			
			///////////////////////////////////////////////////////////////////////////////////////////////
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Накладные", СписокПНК.ВыгрузитьКолонку("ПриходнаяНакладная"));
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеквизитыРНКПНКПРМ.ИмяРеквизита КАК ИмяРеквизита,
			|	ЕСТЬNULL(РеквизитыРНКПНКПРМ.ЗначениеРеквизита, """") КАК ЗначениеРеквизита
			|ИЗ
			|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
			|ГДЕ
			|	РеквизитыРНКПНКПРМ.Документ В(&Накладные)
			|	И РеквизитыРНКПНКПРМ.ИмяРеквизита В(&МассивИменРеквизитов)";
			
			МассивИменРеквизитов = Новый Массив;
			МассивИменРеквизитов.Добавить("МаркаАвтомобиля");
			МассивИменРеквизитов.Добавить("НомерПрицепа");
			МассивИменРеквизитов.Добавить("МаркаПрицепа");
			МассивИменРеквизитов.Добавить("НомерКонтейнера");
			
			Запрос.УстановитьПараметр("МассивИменРеквизитов", МассивИменРеквизитов);
			
			УстановитьПривилегированныйРежим(Истина);
			Реквизиты = Запрос.Выполнить().Выгрузить();
			УстановитьПривилегированныйРежим(Ложь);
			
			/////////////////////////////// МаркаАвтомобиля ////////////////////////////////////////////////
			
			МаркаАвтомобиля = "";
			
			СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "МаркаАвтомобиля"));
			Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
				Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
					МаркаАвтомобиля = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			СтрокиПодвижнойСостав = ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Автомобиль"));
			Если СтрокиПодвижнойСостав.Количество() > 0 Тогда
				Для Каждого СтрокаПодвижнойСостав ИЗ СтрокиПодвижнойСостав Цикл
					Если МаркаАвтомобиля <> "" Тогда 
						СтрокаПодвижнойСостав.Марка = МаркаАвтомобиля;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если МаркаАвтомобиля <> "" Тогда
					НоваяСтрока = ПодвижнойСостав.Добавить();
					НоваяСтрока.Вид = "Автомобиль";
					НоваяСтрока.Марка = МаркаАвтомобиля;
					НоваяСтрока.Номер = НомерМашины;
				КонецЕсли;
			КонецЕсли;
			
			///////////////////////////////// МаркаПрицепа /////////////////////////////////////////////////
			
			НомерПрицепа = ""; МаркаПрицепа = ""; НомерКонтейнера = "";
			
			СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "НомерПрицепа"));
			Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
				Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
					НомерПрицепа = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "МаркаПрицепа"));
			Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл
				Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
					МаркаПрицепа = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если МаркаПрицепа <> "" ИЛИ НомерПрицепа <> "" Тогда
				НоваяСтрока = ПодвижнойСостав.Добавить();
				НоваяСтрока.Вид = "Прицеп/Полуприцеп";
				НоваяСтрока.Марка = МаркаПрицепа;
				НоваяСтрока.Номер = НомерПрицепа;
			КонецЕсли;
			
			СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "НомерКонтейнера"));
			Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
				Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
					НомерКонтейнера = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			Если НомерКонтейнера <> "" Тогда
				НоваяСтрока = ПодвижнойСостав.Добавить();
				НоваяСтрока.Вид = "Контейнер";
				НоваяСтрока.Номер = НомерКонтейнера;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КоллективныеРаботы") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		ДокОснование = Основание;
		СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом;
		
	    ЗаполнитьСписокПНК_КоллективныеРаботы(Основание);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Накладные", СписокПНК.ВыгрузитьКолонку("ПриходнаяНакладная"));
		
		/////////////// РЕКВИЗИТЫ ПНК /////////////////////////////////////////////
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка,
		|	МАКСИМУМ(Документ.НомерМашины) КАК Номер,
		|	МАКСИМУМ(Документ.ТранспортнаяКомпания) КАК ТранспортнаяКомпания,
		|	МАКСИМУМ(ЕСТЬNULL(Документ.Договор.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК Организация
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&Накладные)
		|
		|СГРУППИРОВАТЬ ПО
		|	Документ.Ссылка";
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		НомерМашины = "";
		
		Пока Выборка.Следующий() Цикл
				
			ТранспортнаяКомпания = Выборка.ТранспортнаяКомпания;
			
			Если Выборка.Организация <> Справочники.Организации.ПустаяСсылка() Тогда
				Организация = Выборка.Организация;	
			КонецЕсли;

			Если СокрЛП(Выборка.Номер) <> "" Тогда				
				НоваяСтрока = ПодвижнойСостав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Вид = "Автомобиль";
				НоваяСтрока.ИдСтроки = Строка(Новый УникальныйИдентификатор());
					
				НомерМашины = СокрЛП(Выборка.Номер);
			КонецЕсли;
				
		КонецЦикла;
		
		/////////// НЕ НАШЛИ В ПНК, СМОТРИМ В ЗАЯВКЕ НА ОТГРУЗКУ //////////////////////////////////////
		
		Если ПодвижнойСостав.Количество() = 0 Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	""Автомобиль"" КАК Вид,
			|	Накладные.Автомобиль.Марка КАК Марка,
			|	Накладные.Автомобиль.ГосНомер КАК Номер,
			|	Накладные.Автомобиль.Водитель КАК Водитель,
			|	Накладные.Ссылка.Дата КАК Дата,
			|	Накладные.ТранспортнаяКомпанияОтправитель КАК ТранспортнаяКомпания
			|ИЗ
			|	Документ.ЗаявкаНаОтгрузку.Накладные КАК Накладные
			|ГДЕ
			|	Накладные.Ссылка.Проведен
			|	И Накладные.Накладная В(&Накладные)
			|	И Накладные.Автомобиль.ГосНомер <> """"
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
			
			НомерМашины = "";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ПодвижнойСостав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка,,"Водитель");
				НоваяСтрока.Водитель = Строка(Выборка.Водитель);
				НоваяСтрока.ИдСтроки = Строка(Выборка.Водитель.УникальныйИдентификатор());
				
				Если НЕ ЗначениеЗаполнено(ТранспортнаяКомпания) Тогда
					ТранспортнаяКомпания = Выборка.ТранспортнаяКомпания;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(НомерМашины) Тогда
					НомерМашины = СокрЛП(Выборка.Номер);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////////////////////////
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ИмяРеквизита КАК ИмяРеквизита,
		|	ЕСТЬNULL(РеквизитыРНКПНКПРМ.ЗначениеРеквизита, """") КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ В(&Накладные)
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита В(&МассивИменРеквизитов)";
		
		МассивИменРеквизитов = Новый Массив;
		МассивИменРеквизитов.Добавить("МаркаАвтомобиля");
		МассивИменРеквизитов.Добавить("НомерПрицепа");
		МассивИменРеквизитов.Добавить("МаркаПрицепа");
		МассивИменРеквизитов.Добавить("НомерКонтейнера");
		
		Запрос.УстановитьПараметр("МассивИменРеквизитов", МассивИменРеквизитов);
		
		УстановитьПривилегированныйРежим(Истина);
		Реквизиты = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		/////////////////////////////// МаркаАвтомобиля ////////////////////////////////////////////////
		
		МаркаАвтомобиля = "";
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "МаркаАвтомобиля"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				МаркаАвтомобиля = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		СтрокиПодвижнойСостав = ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Автомобиль"));
		Если СтрокиПодвижнойСостав.Количество() > 0 Тогда
			Для Каждого СтрокаПодвижнойСостав ИЗ СтрокиПодвижнойСостав Цикл
				Если МаркаАвтомобиля <> "" Тогда 
					СтрокаПодвижнойСостав.Марка = МаркаАвтомобиля;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если МаркаАвтомобиля <> "" Тогда
				НоваяСтрока = ПодвижнойСостав.Добавить();
				НоваяСтрока.Вид = "Автомобиль";
				НоваяСтрока.Марка = МаркаАвтомобиля;
				НоваяСтрока.Номер = НомерМашины;
			КонецЕсли;
		КонецЕсли;
		
		///////////////////////////////// МаркаПрицепа /////////////////////////////////////////////////
		
		НомерПрицепа = ""; МаркаПрицепа = ""; НомерКонтейнера = "";
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "НомерПрицепа"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				НомерПрицепа = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "МаркаПрицепа"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				МаркаПрицепа = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если МаркаПрицепа <> "" ИЛИ НомерПрицепа <> "" Тогда
			НоваяСтрока = ПодвижнойСостав.Добавить();
			НоваяСтрока.Вид = "Прицеп/Полуприцеп";
			НоваяСтрока.Марка = МаркаПрицепа;
			НоваяСтрока.Номер = НомерПрицепа;
		КонецЕсли;
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "НомерКонтейнера"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				НомерКонтейнера = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НомерКонтейнера <> "" Тогда
			НоваяСтрока = ПодвижнойСостав.Добавить();
			НоваяСтрока.Вид = "Контейнер";
			НоваяСтрока.Номер = НомерКонтейнера;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("Массив") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Накладные", Основание);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК ПриходнаяНакладная,
		|	МАКСИМУМ(ПОДСТРОКА(Товары.Ссылка.ГруппыТоваров, 1, 1000)) КАК ГруппыТоваров,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Товары.Номенклатура) КАК КоличествоСтрок,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
		|				ТОГДА Товары.Количество / Товары.Номенклатура.Родитель.ШтукВКоробке
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоКоробов
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	НЕ Товары.Ссылка.ПометкаУдаления
		|	И Товары.Ссылка В(&Накладные)
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товары.Ссылка.Номер";
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаТЧ = Запрос.Выполнить().Выгрузить();
		СписокПНК.Загрузить(ТаблицаТЧ);
		УстановитьПривилегированныйРежим(Ложь);
		
		Для Каждого СтрПНК ИЗ СписокПНК Цикл
			ЗаполнитьСтрокуСпискаПНКПриИзмененииПНК(СтрПНК);
		КонецЦикла;
		
		/////////////// РЕКВИЗИТЫ ПНК /////////////////////////////////////////////
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка,
		|	МАКСИМУМ(Документ.НомерМашины) КАК Номер,
		|	МАКСИМУМ(Документ.ТранспортнаяКомпания) КАК ТранспортнаяКомпания,
		|	МАКСИМУМ(ЕСТЬNULL(Документ.Договор.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК Организация
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&Накладные)
		|
		|СГРУППИРОВАТЬ ПО
		|	Документ.Ссылка";
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		НомерМашины = "";
		
		Пока Выборка.Следующий() Цикл
			
			ТранспортнаяКомпания = Выборка.ТранспортнаяКомпания;
			
			Если Выборка.Организация <> Справочники.Организации.ПустаяСсылка() Тогда
				Организация = Выборка.Организация;	
			КонецЕсли;
			
			Если СокрЛП(Выборка.Номер) <> "" Тогда
				НоваяСтрока = ПодвижнойСостав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Вид = "Автомобиль";
				НоваяСтрока.ИдСтроки = Строка(Новый УникальныйИдентификатор());
				
				НомерМашины = СокрЛП(Выборка.Номер);
			КонецЕсли;
			
		КонецЦикла;
		
		/////////// НЕ НАШЛИ В ПНК, СМОТРИМ В ЗАЯВКЕ НА ОТГРУЗКУ //////////////////////////////////////
		
		Если ПодвижнойСостав.Количество() = 0 Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	""Автомобиль"" КАК Вид,
			|	Накладные.Автомобиль.Марка КАК Марка,
			|	Накладные.Автомобиль.ГосНомер КАК Номер,
			|	Накладные.Автомобиль.Водитель КАК Водитель,
			|	Накладные.Ссылка.Дата КАК Дата,
			|	Накладные.ТранспортнаяКомпанияОтправитель КАК ТранспортнаяКомпания
			|ИЗ
			|	Документ.ЗаявкаНаОтгрузку.Накладные КАК Накладные
			|ГДЕ
			|	Накладные.Ссылка.Проведен
			|	И Накладные.Накладная В(&Накладные)
			|	И Накладные.Автомобиль.ГосНомер <> """"
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
			
			УстановитьПривилегированныйРежим(Истина);
			Выборка = Запрос.Выполнить().Выбрать();
			УстановитьПривилегированныйРежим(Ложь);
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ПодвижнойСостав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка,,"Водитель");
				НоваяСтрока.Водитель = Строка(Выборка.Водитель);
				НоваяСтрока.ИдСтроки = Строка(Выборка.Водитель.УникальныйИдентификатор());
				
				Если НЕ ЗначениеЗаполнено(ТранспортнаяКомпания) Тогда
					ТранспортнаяКомпания = Выборка.ТранспортнаяКомпания;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(НомерМашины) Тогда
					НомерМашины = СокрЛП(Выборка.Номер);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		/////////////////// РеквизитыРНКПНКПРМ ////////////////////////////////////////////////////////
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ИмяРеквизита КАК ИмяРеквизита,
		|	ЕСТЬNULL(РеквизитыРНКПНКПРМ.ЗначениеРеквизита, """") КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ В(&Накладные)
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита В(&МассивИменРеквизитов)";
		
		МассивИменРеквизитов = Новый Массив;
		МассивИменРеквизитов.Добавить("МаркаАвтомобиля");
		МассивИменРеквизитов.Добавить("НомерПрицепа");
		МассивИменРеквизитов.Добавить("МаркаПрицепа");
		МассивИменРеквизитов.Добавить("НомерКонтейнера");
		
		Запрос.УстановитьПараметр("МассивИменРеквизитов", МассивИменРеквизитов);
		
		УстановитьПривилегированныйРежим(Истина);
		Реквизиты = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		/////////////////////////////// МаркаАвтомобиля ////////////////////////////////////////////////
		
		МаркаАвтомобиля = "";
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "МаркаАвтомобиля"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				МаркаАвтомобиля = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		СтрокиПодвижнойСостав = ПодвижнойСостав.НайтиСтроки(Новый Структура("Вид", "Автомобиль"));
		Если СтрокиПодвижнойСостав.Количество() > 0 Тогда
			Для Каждого СтрокаПодвижнойСостав ИЗ СтрокиПодвижнойСостав Цикл
				Если МаркаАвтомобиля <> "" Тогда 
					СтрокаПодвижнойСостав.Марка = МаркаАвтомобиля;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если МаркаАвтомобиля <> "" Тогда
				НоваяСтрока = ПодвижнойСостав.Добавить();
				НоваяСтрока.Вид = "Автомобиль";
				НоваяСтрока.Марка = МаркаАвтомобиля;
				НоваяСтрока.Номер = НомерМашины;
			КонецЕсли;
		КонецЕсли;
		
		///////////////////////////////// МаркаПрицепа /////////////////////////////////////////////////
		
		НомерПрицепа = ""; МаркаПрицепа = ""; НомерКонтейнера = "";
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "НомерПрицепа"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				НомерПрицепа = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "МаркаПрицепа"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				МаркаПрицепа = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если МаркаПрицепа <> "" ИЛИ НомерПрицепа <> "" Тогда
			НоваяСтрока = ПодвижнойСостав.Добавить();
			НоваяСтрока.Вид = "Прицеп/Полуприцеп";
			НоваяСтрока.Марка = МаркаПрицепа;
			НоваяСтрока.Номер = НомерПрицепа;
		КонецЕсли;
		
		СтрокиРеквизитов = Реквизиты.НайтиСтроки(Новый Структура("ИмяРеквизита", "НомерКонтейнера"));
		Для Каждого СтрокаРеквизитов ИЗ СтрокиРеквизитов Цикл 
			Если СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита) <> "" Тогда
				НомерКонтейнера = СокрЛП(СтрокаРеквизитов.ЗначениеРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НомерКонтейнера <> "" Тогда
			НоваяСтрока = ПодвижнойСостав.Добавить();
			НоваяСтрока.Вид = "Контейнер";
			НоваяСтрока.Номер = НомерКонтейнера;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьТовары_Заполнение();
	
	// Шворобей ВЮ 26.12.2023 ++
	ТаблицаСоответствия = ЗаполнитьКомиссиюИзТаблицыНастроек(Организация);
	
	Если ТаблицаСоответствия.Количество() > 0 Тогда
		Комиссия.Очистить();
		Для Каждого Стр ИЗ ТаблицаСоответствия Цикл
			ЗаполнитьЗначенияСвойств(Комиссия.Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;
	// Шворобей ВЮ 26.12.2023 ++
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьСписокПНК(Основание = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Машина", ?(Основание = Неопределено, ДокОснование, Основание));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК ПриходнаяНакладная,
	|	МАКСИМУМ(ПОДСТРОКА(Товары.Ссылка.ГруппыТоваров, 1, 1000)) КАК ГруппыТоваров,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Товары.Номенклатура) КАК КоличествоСтрок,
	|	СУММА(Товары.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|				ТОГДА Товары.Количество / Товары.Номенклатура.Родитель.ШтукВКоробке
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоКоробов
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка.ДокОснование В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Документ.Машина.Заказы.Заказ
	|			ИЗ
	|				Документ.Машина.Заказы
	|			ГДЕ
	|				Документ.Машина.Заказы.Ссылка = &Машина)
	|	И НЕ Товары.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Ссылка.Номер";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаТЧ = Запрос.Выполнить().Выгрузить();
	СписокПНК.Загрузить(ТаблицаТЧ);
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого СтрПНК ИЗ СписокПНК Цикл
		ЗаполнитьСтрокуСпискаПНКПриИзмененииПНК(СтрПНК);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокПНК_КоллективныеРаботы(Основание = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ?(Основание = Неопределено, ДокОснование, Основание));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Накладные.Накладная КАК ПриходнаяНакладная,
	|	МАКСИМУМ(ПОДСТРОКА(Накладные.Накладная.ГруппыТоваров, 1, 1000)) КАК ГруппыТоваров,
	|	СУММА(Накладные.КоличествоКоробок) КАК КоличествоКоробов,
	|	СУММА(Накладные.КоличествоСтрок) КАК КоличествоСтрок,
	|	СУММА(Накладные.КоличествоПаллет) КАК КоличествоПаллет
	|ИЗ
	|	Документ.КоллективныеРаботы.Накладные КАК Накладные
	|ГДЕ
	|	Накладные.Ссылка = &ДокОснование
	|	И ТИПЗНАЧЕНИЯ(Накладные.Накладная) = ТИП(Документ.ПриходнаяНакладная)
	|
	|СГРУППИРОВАТЬ ПО
	|	Накладные.Накладная";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаТЧ = Запрос.Выполнить().Выгрузить();
	СписокПНК.Загрузить(ТаблицаТЧ);
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого СтрПНК ИЗ СписокПНК Цикл
		ЗаполнитьСтрокуСпискаПНКПриИзмененииПНК(СтрПНК);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТовары_Заполнение() Экспорт
	
	ТоварыБрак = Товары.Выгрузить().СкопироватьКолонки();
	
	Если Товары.Количество() > 0 Тогда
		Для Каждого Стр ИЗ Товары Цикл
			Если Стр.Брак > 0 Тогда
				ЗаполнитьЗначенияСвойств(ТоварыБрак.Добавить(), Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокПНК", СписокПНК.ВыгрузитьКолонку("ПриходнаяНакладная"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(Товары.Количество, 0)) КАК КоличествоПринято
	|ПОМЕСТИТЬ ТоварыЛистыНабора
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК Товары
	|ГДЕ
	|	ВЫРАЗИТЬ(Товары.Ссылка.ДокОснование КАК Документ.ПриходнаяНакладная) В (&СписокПНК)
	|	И Товары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(Товары.ПодтвержденнаяЗаявка, 0)) КАК КоличествоВПНК
	|ПОМЕСТИТЬ ТоварыПриходныеНакладные
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&СписокПНК)
	|	И Товары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыЛистыНабора.Номенклатура, ТоварыПриходныеНакладные.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыЛистыНабора.Номенклатура.Родитель, ТоварыПриходныеНакладные.Номенклатура.Родитель)) КАК Модель,
	|	СУММА(ЕСТЬNULL(ТоварыЛистыНабора.КоличествоПринято, 0)) КАК КоличествоПринято,
	|	СУММА(ЕСТЬNULL(ТоварыПриходныеНакладные.КоличествоВПНК, 0)) КАК КоличествоВПНК,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТоварыЛистыНабора.КоличествоПринято, 0) > ЕСТЬNULL(ТоварыПриходныеНакладные.КоличествоВПНК, 0)
	|				ТОГДА ЕСТЬNULL(ТоварыЛистыНабора.КоличествоПринято, 0) - ЕСТЬNULL(ТоварыПриходныеНакладные.КоличествоВПНК, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Излишки,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТоварыПриходныеНакладные.КоличествоВПНК, 0) > ЕСТЬNULL(ТоварыЛистыНабора.КоличествоПринято, 0)
	|				ТОГДА ЕСТЬNULL(ТоварыПриходныеНакладные.КоличествоВПНК, 0) - ЕСТЬNULL(ТоварыЛистыНабора.КоличествоПринято, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Недостача
	|ИЗ
	|	ТоварыПриходныеНакладные КАК ТоварыПриходныеНакладные
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыЛистыНабора КАК ТоварыЛистыНабора
	|		ПО ТоварыПриходныеНакладные.Номенклатура = ТоварыЛистыНабора.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыЛистыНабора.Номенклатура, ТоварыПриходныеНакладные.Номенклатура)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ТоварыЛистыНабора.КоличествоПринято, 0)) <> СУММА(ЕСТЬNULL(ТоварыПриходныеНакладные.КоличествоВПНК, 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыЛистыНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыПриходныеНакладные";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаТЧ = Запрос.Выполнить().Выгрузить();
	Товары.Загрузить(ТаблицаТЧ);
	УстановитьПривилегированныйРежим(Ложь);
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ТоварыБрак.Количество() > 0 Тогда
		Для Каждого Стр ИЗ ТоварыБрак Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Шворобей ВЮ 26.12.2023 ++
Функция ЗаполнитьКомиссиюИзТаблицыНастроек(Организация, Сотрудник = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиСоответствия.ЗначениеНастройки КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(СтрокиСоответствия.ПредставлениеНастройки КАК СТРОКА(200))) <> """"
	|			ТОГДА ВЫРАЗИТЬ(СтрокиСоответствия.ПредставлениеНастройки КАК СТРОКА(200))
	|		ИНАЧЕ СтрокиСоответствия.ЗначениеНастройки.Должность
	|	КОНЕЦ КАК Должность
	|ИЗ
	|	Справочник.ТаблицаНастроекЗаполненияСписков.СтрокиСоответствия КАК СтрокиСоответствия
	|ГДЕ
	|	СтрокиСоответствия.Ссылка.ОсновнойРеквизит = &Организация
	|	И СтрокиСоответствия.Ссылка.ТипНастройки = ЗНАЧЕНИЕ(Справочник.ТипыНастроекЗаполненияСписков.СоставКомиссииОрганизации)
	|	И ТИПЗНАЧЕНИЯ(СтрокиСоответствия.ЗначениеНастройки) = ТИП(Справочник.ФизическиеЛица)
	|	И НЕ СтрокиСоответствия.Ссылка.ПометкаУдаления
	|	" + ?(Сотрудник <> Неопределено, "И СтрокиСоответствия.ЗначениеНастройки = &Сотрудник", "") + "";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСоответствия = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаСоответствия;
	
КонецФункции
// Шворобей ВЮ 26.12.2023 ++

////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СписокГруппНоменклатуры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Номенклатура.Родитель.Родитель.Брэнд = """" ТОГДА Номенклатура.Родитель.Родитель.Наименование
	|		ИНАЧЕ Номенклатура.Родитель.Родитель.Брэнд
	|	КОНЕЦ КАК Брэнд,
	|	Номенклатура.Родитель КАК Модель,
	|	Номенклатура.Родитель.Наименование КАК Модель_Представление
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Ссылка В(&СписокПНК)
	|УПОРЯДОЧИТЬ ПО	
	|	Модель_Представление,
	|	Брэнд
	|";
	
	Запрос.УстановитьПараметр("СписокПНК",СписокПНК.ВыгрузитьКолонку("ПриходнаяНакладная"));
	
	Список=Новый СписокЗначений;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Список.Добавить(Выборка.Модель,""+Выборка.Модель+" ("+Выборка.Брэнд+")");	
	КонецЦикла; 
	
	Возврат Список;
КонецФункции
 
////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	
КонецПроцедуры

// Кухарь А.Ю. 26.04.2021 начало
//
Процедура ЗаполнитьСтрокуСпискаПНКПриИзмененииПНК(СтрТЧ) экспорт
	ПНК=СтрТЧ.ПриходнаяНакладная;
	если ложь тогда ПНК=документы.ПриходнаяНакладная.ПустаяСсылка();КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтрТЧ,ПНК);
	СтрТЧ.КоличествоСтрок=ПНК.товары.количество();
	СтрТЧ.количество=ПНК.КоличествоДокумента;
	СтрТЧ.КоличествоКоробов=ПНК.КоличествоКоробок;
	СтрТЧ.объем=пнк.ОбъемДокумента;			
КонецПроцедуры
// Кухарь А.Ю. 26.04.2021 конец

////////////////////////////////////////////////////////////////////////////////////////////////////
